; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v13 ?v1)
             (pred_3 ?v11 ?v2)
             (pred_10 ?v13 ?v2)
             (pred_9 ?v10 ?v13 )
	     (pred_7 ?v13)
             (pred_5 ?v8)
             (pred_4 ?v11)
             (pred_1 ?v2)
             (pred_11 ?v13)
             (pred_6 ?v11)
             (pred_8 ?v13)
             (pred_12 ))



(:action op_4
:parameters (?v4 ?v6 ?v3 ?v5)
:precondition (and (pred_5 ?v4) (pred_5 ?v6) (pred_4 ?v3) (pred_1 ?v5)
          (pred_2 ?v4 ?v6) (pred_3 ?v3 ?v5)
                   (pred_10 ?v6 ?v5) (pred_7 ?v4) 
                   (pred_11 ?v6) (pred_6 ?v3))
:effect (and  (pred_8 ?v6) (not (pred_11 ?v6))))


(:action op_2
:parameters (?v4 ?v12)
:precondition (and (pred_5 ?v4) (pred_5 ?v12)
               (pred_7 ?v4) (pred_2 ?v4 ?v12) (pred_8 ?v12))
:effect (and (pred_7 ?v12) (not (pred_7 ?v4))))

(:action op_3
:parameters (?v4 ?v3)
:precondition (and (pred_5 ?v4) (pred_4 ?v3) 
                  (pred_7 ?v4) (pred_9 ?v3 ?v4) (pred_12 ))
:effect (and (pred_6 ?v3)
   (not (pred_9 ?v3 ?v4)) (not (pred_12 ))))


(:action op_5
:parameters (?v4 ?v9 ?v7)
:precondition (and (pred_5 ?v4) (pred_4 ?v9) (pred_4 ?v7)
                  (pred_7 ?v4) (pred_6 ?v7) (pred_9 ?v9 ?v4))
:effect (and (pred_6 ?v9) (pred_9 ?v7 ?v4)
        (not (pred_6 ?v7)) (not (pred_9 ?v9 ?v4))))

(:action op_1
:parameters (?v4 ?v3)
:precondition (and (pred_5 ?v4) (pred_4 ?v3) 
                  (pred_7 ?v4) (pred_6 ?v3))
:effect (and (pred_12 ) (pred_9 ?v3 ?v4) (not (pred_6 ?v3)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_24 obj_25 obj_16 obj_22 obj_10 obj_27 obj_20 obj_17 obj_06 obj_23 obj_18 obj_12 obj_05 obj_30 obj_04 obj_01 obj_15 obj_28 obj_02 obj_14 obj_09 obj_26 obj_21 obj_03
    obj_29 obj_11 obj_13
    obj_08 obj_19 obj_31
    )

    (:init
       (pred_12)

       (pred_5 obj_07)
       (pred_5 obj_24)
       (pred_5 obj_25)
       (pred_5 obj_16)
       (pred_5 obj_22)
       (pred_5 obj_10)
       (pred_5 obj_27)
       (pred_5 obj_20)
       (pred_5 obj_17)
       (pred_5 obj_06)
       (pred_5 obj_23)
       (pred_5 obj_18)
       (pred_5 obj_12)
       (pred_5 obj_05)
       (pred_5 obj_30)
       (pred_5 obj_04)
       (pred_5 obj_01)
       (pred_5 obj_15)
       (pred_5 obj_28)
       (pred_5 obj_02)
       (pred_5 obj_14)
       (pred_5 obj_09)
       (pred_5 obj_26)
       (pred_5 obj_21)
       (pred_5 obj_03)
       (pred_1 obj_29)
       (pred_1 obj_11)
       (pred_1 obj_13)
       (pred_4 obj_08)
       (pred_4 obj_19)
       (pred_4 obj_31)

       (pred_2 obj_07 obj_10)
       (pred_2 obj_07 obj_24)
       (pred_2 obj_24 obj_27)
       (pred_2 obj_24 obj_25)
       (pred_2 obj_24 obj_07)
       (pred_2 obj_25 obj_20)
       (pred_2 obj_25 obj_16)
       (pred_2 obj_25 obj_24)
       (pred_2 obj_16 obj_17)
       (pred_2 obj_16 obj_22)
       (pred_2 obj_16 obj_25)
       (pred_2 obj_22 obj_06)
       (pred_2 obj_22 obj_16)
       (pred_2 obj_10 obj_23)
       (pred_2 obj_10 obj_27)
       (pred_2 obj_10 obj_07)
       (pred_2 obj_27 obj_18)
       (pred_2 obj_27 obj_20)
       (pred_2 obj_27 obj_24)
       (pred_2 obj_27 obj_10)
       (pred_2 obj_20 obj_12)
       (pred_2 obj_20 obj_17)
       (pred_2 obj_20 obj_25)
       (pred_2 obj_20 obj_27)
       (pred_2 obj_17 obj_05)
       (pred_2 obj_17 obj_06)
       (pred_2 obj_17 obj_16)
       (pred_2 obj_17 obj_20)
       (pred_2 obj_06 obj_30)
       (pred_2 obj_06 obj_22)
       (pred_2 obj_06 obj_17)
       (pred_2 obj_23 obj_04)
       (pred_2 obj_23 obj_18)
       (pred_2 obj_23 obj_10)
       (pred_2 obj_18 obj_01)
       (pred_2 obj_18 obj_12)
       (pred_2 obj_18 obj_27)
       (pred_2 obj_18 obj_23)
       (pred_2 obj_12 obj_15)
       (pred_2 obj_12 obj_05)
       (pred_2 obj_12 obj_20)
       (pred_2 obj_12 obj_18)
       (pred_2 obj_05 obj_28)
       (pred_2 obj_05 obj_30)
       (pred_2 obj_05 obj_17)
       (pred_2 obj_05 obj_12)
       (pred_2 obj_30 obj_02)
       (pred_2 obj_30 obj_06)
       (pred_2 obj_30 obj_05)
       (pred_2 obj_04 obj_14)
       (pred_2 obj_04 obj_01)
       (pred_2 obj_04 obj_23)
       (pred_2 obj_01 obj_09)
       (pred_2 obj_01 obj_15)
       (pred_2 obj_01 obj_18)
       (pred_2 obj_01 obj_04)
       (pred_2 obj_15 obj_26)
       (pred_2 obj_15 obj_28)
       (pred_2 obj_15 obj_12)
       (pred_2 obj_15 obj_01)
       (pred_2 obj_28 obj_21)
       (pred_2 obj_28 obj_02)
       (pred_2 obj_28 obj_05)
       (pred_2 obj_28 obj_15)
       (pred_2 obj_02 obj_03)
       (pred_2 obj_02 obj_30)
       (pred_2 obj_02 obj_28)
       (pred_2 obj_14 obj_09)
       (pred_2 obj_14 obj_04)
       (pred_2 obj_09 obj_26)
       (pred_2 obj_09 obj_01)
       (pred_2 obj_09 obj_14)
       (pred_2 obj_26 obj_21)
       (pred_2 obj_26 obj_15)
       (pred_2 obj_26 obj_09)
       (pred_2 obj_21 obj_03)
       (pred_2 obj_21 obj_28)
       (pred_2 obj_21 obj_26)
       (pred_2 obj_03 obj_02)
       (pred_2 obj_03 obj_21)
       (pred_11 obj_23)
       (pred_11 obj_28)
       (pred_11 obj_12)
       (pred_10  obj_23 obj_29)
       (pred_10  obj_28 obj_11)
       (pred_10  obj_12 obj_13)
       (pred_8 obj_07)
       (pred_8 obj_24)
       (pred_8 obj_25)
       (pred_8 obj_16)
       (pred_8 obj_22)
       (pred_8 obj_10)
       (pred_8 obj_27)
       (pred_8 obj_20)
       (pred_8 obj_17)
       (pred_8 obj_06)
       (pred_8 obj_18)
       (pred_8 obj_05)
       (pred_8 obj_30)
       (pred_8 obj_04)
       (pred_8 obj_01)
       (pred_8 obj_15)
       (pred_8 obj_02)
       (pred_8 obj_14)
       (pred_8 obj_09)
       (pred_8 obj_26)
       (pred_8 obj_21)
       (pred_8 obj_03)

       (pred_3  obj_08 obj_29)
       (pred_3  obj_19 obj_11)
       (pred_3  obj_31 obj_13)
       (pred_9 obj_08 obj_07)
       (pred_9 obj_19 obj_10)
       (pred_9 obj_31 obj_15)
       (pred_7 obj_30)
    )

    (:goal (and
       (pred_9 obj_19 obj_07)
    ))
(:constraints
  (always (not (pred_7 obj_17)))
)
)

; plan
1. (op_2 obj_30 obj_06)
   deleted: (pred_7 obj_30)
   added: (pred_7 obj_06)
   goals met: 0 of 1
2. (op_2 obj_06 obj_22)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_22)
   goals met: 0 of 1
3. (op_2 obj_22 obj_16)
   deleted: (pred_7 obj_22)
   added: (pred_7 obj_16)
   goals met: 0 of 1
4. (op_2 obj_16 obj_25)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_25)
   goals met: 0 of 1
5. (op_2 obj_25 obj_24)
   deleted: (pred_7 obj_25)
   added: (pred_7 obj_24)
   goals met: 0 of 1
6. (op_2 obj_24 obj_07)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_07)
   goals met: 0 of 1
7. (op_2 obj_07 obj_10)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_10)
   goals met: 0 of 1
8. (op_3 obj_10 obj_19)
   deleted: (pred_9 obj_19 obj_10) (pred_12)
   added: (pred_6 obj_19)
   goals met: 0 of 1
9. (op_2 obj_10 obj_07)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_07)
   goals met: 0 of 1
10. (op_5 obj_07 obj_08 obj_19)
   deleted: (pred_6 obj_19) (pred_9 obj_08 obj_07)
   added: (pred_6 obj_08) (pred_9 obj_19 obj_07)
   goals met: 1 of 1
